// names.js
const firstNames = [
    "佐藤", "鈴木", "高橋", "田中", "伊藤", "渡辺", "山本", "中村", "小林", "加藤", 
    "吉田", "山田", "佐々木", "山口", "松本", "井上", "木村", "林", "斎藤", "清水", 
    "山崎", "森", "池田", "橋本", "阿部", "石川", "山下", "中島", "小川", "前田", 
    "岡田", "長谷川", "藤田", "後藤", "近藤", "村上", "遠藤", "青木", "坂本", "福田", 
    "太田", "西村", "藤井", "金子", "岡本", "藤原", "中野", "三浦", "原田", "高田"
];

const lastNames = [
    "翔", "大翔", "拓海", "健太", "大輔", "和也", "修平", "駿", "翼", "陽斗", 
    "悠真", "樹", "蓮", "湊", "新", "哲也", "崇", "浩二", "真一", "竜也", 
    "大輝", "誠", "剛", "達也", "裕太", "亮明", "一樹", "雄大", "晃", "健一", 
    "大樹", "智也", "拓也", "淳", "克也", "祥吾", "裕介", "康平", "貴大", "健二", 
    "正人", "秀明", "俊介", "隆弘", "徹", "宏樹", "圭介", "彰", "慎太郎", "涼介"
];

function generateRandomPlayerName() {
    let f = firstNames[Math.floor(Math.random() * firstNames.length)];
    let l = lastNames[Math.floor(Math.random() * lastNames.length)];
    return `${f} ${l}`;
}
